{
    "opening": [
        "You are Forel.",
        "Urchin bastard, orphaned at three and sent from your mother's home by thugs not long after.",
        "For two years, you had scrambled for what meager offerings the market rubbish would grant. Never taking more than you could eat in that moment, for you had learned the hard way the abilities of your meager frame.",

        "He is Eraton Sydan. King of Sewinso, after the tragedy that claimed your mother's life claimed his father as well.", 
        "Yet the cruelty of the world did not harden his heart. For when your craven flesh impacted his, his hand went not to his blade, but to you.",

        "You became fast friends. You had fights aplenty, not the least of which when the king learned your lodgings were less than lacking and invited, then demanded, you to stay in his castle.", 
        "It was, as the queen dowager would say, as boys are wont to do.", 
        "Yet never did these petty squabbles shatter your bond. And in time, the fights ceased. You had found yourself yearning for more than your king's friendship.",
        "And your king...", 
        "shared in your desire.",
        "A blessing from the Eight.",

        "Yet not all was well. Visiting nobles had learned of their king's urchin companion.",
        "It was disgusting. The king had several companions within the Phitemos of noble lineage. Yet he played with an insect like a boy in the streets.",
        "Eraton assured you, told you to ignore their words.",
        "Yet you could not bring yourself to disagree. Eraton had given you much, but you? You a burden in your current state.",
        "And so, you had vowed to become worthy of your king. You would protect him as he protected you.",

        "And so, you would train.",
        "Time had done little for your meager frame, or your strength. And so, you had chosen to train in the art of miracles. Praying to the Eight and being rewarded for your faith with feats inhuman.",

        "And today, young Forel, you have chosen to begin your quest. You shall journey the kingdom of Sewinso," 
    ],
    "joke_ending_0" : [
        "And lo, rather than journeying out to prove your worth, you have chosen to be a little baby and just stay here in the castle.",
        "back_to_main_menu"
    ]
}