{
  "burning_student": {
    "trigger": "on_step",
    "flags": [
      "saw_jin_shi_die"
    ],
    "script": [
      "???__Good {time_of_day}, class!",
      "invisible_leader=true",
      "walk=leader__S3E8",
      "Disciples (in unison)__Good {time_of_day}, Bubba Renald!",
      "???__How are you doing today, Bubba Renald?",
      "Bubba Renald__I am well, Aiyanna, thank you for asking.",
      "Aiyanna__Oh, wow! Mei-Hua, did you hear that?",
      "Mei-Hua__'I am well'! He is well-spoken!",
      "Aiyanna__So sophisticated!",
      "Mei-Hua__And did you hear? He say your name!",
      "Aiyanna__Oh wow, you're right!",
      "Bubba Renald__Alright, settle down, ladies.",
      "Bubba Renald__You've all done well to get this far. Some of you had never spoke a word of Promen before coming here. The fact you've made it so far in spite of such a handicap speaks to your faith in Prometus and His generosity.",
      "Bubba Renald__But don't think this means you're done. It will take far more training and devotion to become a great wizard, should that be your goal.",
      "Bubba Renald__But that's a concern for later. There's no need to cross a chasm in a single bound, when a step at a time across the bridge brings you to the same place.",
      "Bubba Renald__And that next step for you is praying for your first miracle.",
      "Aiyanna__Oh my gosh, already?",
      "Jin-Shi__Our first day as disciples, and we do miracles?",
      "Mei-Hua__No more grammar lectures, we can finally start burning stuff?",
      "Bubba Renald__Did I not just say you weren't done? That includes grammar.",
      "Disciples (in unison)__Uuuuuuugh!",
      "Bubba Renald__And the miracle you'll perform today is hardly for burning things. Turn to page 17 of your texts, and find the prayer of lowering temperature. I trust you all have your texts?",
      "spawn=bookclosed__book_spawn_node_1",
      "Jin-Shi__Yes, Bubba! See, I--",
      "Bubba Renald__I believe I already said to settle down, Jin-Shi.",
      "spawn=bookclosed__book_spawn_node_0__E__3",
      "wait=500",
      "destroy=bookclosed__book_spawn_node_0__E__4",
      "spawn=book__book_spawn_node_0__E__3",
      "spawn=bookfake__book_spawn_node_1",
      "Bubba Renald__Have you all found the prayer?",
      "Jin-Shi__Yes Bubba, it's--",
      "Bubba Renald__Jin-Shi.",
      "Bubba Renald__If you've found it, close your eyes and concentrate on the words and their meanings.",
      "destroy=book__book_spawn_node_0__E__4",
      "destroy=bookfake__book_spawn_node_1",
      "Bubba Renald__Feel the warmth within your body. Feel how it flows through your veins like blood. That is because blood is where we keep our warmth, our heat, our... flame.",
      "Bubba Renald__Now whisper the words, whisper your prayer. Let Prometus, and only Prometus, hear your desire, feel it.",
      "Aiyanna__Brrr!",
      "Mei-Hua__B-b-by Prometus, Bubba Renald I think it's working! My body feels so c-cold--",
      "destroy=npcstudent__student_shi_space",
      "spawn=animatedburningman__student_shi_space",
      "walk=student_2__N1W1--50&&student_3__S1W2--50&&bubba_renald__S2--200",
      "Jin-Shi__Ahhhhh! Ahhhhh!",
      "Jin-Shi__Someone! Anyone! Help me! I--",
      "destroy=animatedburningman__student_shi_space",
      "spawn=burntcorpse__student_shi_space--dead_jin_shi",
      "add_schedule=student_0__leave_node_0__0",
      "add_schedule=student_1__leave_node_1__3",
      "Jin-Shi__...bubba...",
      "walk=student_3__E2N1",
      "change_event_key=burn_jin_shi_event__recovering_burnt_body",
      "give_quest=kesvelt_jin_shi_dies",
      "walk=leader__W8N3",
      "invisible_leader=false"
    ],
    "conditions": ["!saw_jin_shi_die"]
  },
  "burning_student_replace": {
    "trigger": "on_step",
    "flags": [
      "updated_burning_student"
    ],
    "conditions": [
      "!updated_burning_student",
      "have_quest=kesvelt_fake_books"
    ],
    "script": [
      "change_event_key=burn_jin_shi_event__recovering_burnt_body",
      "spawn=npc__student_shi_space__S__1--medic_",
      "walk=medic_0__N1--1&&student_2__N1E1--1",
      "destroy=npcstudent__student_0",
      "destroy=npcstudent__student_1",
      "destroy=npcstudent__student_shi_space",
      "destroy=npc__bubba_renald",
      "!saw_jin_shi_die++spawn=burntcorpse__student_shi_space--dead_jin_shi"
    ]
  },
  "respawn_mei_hua": {
    "trigger": "on_step",
    "conditions": [
      "have_item=key_fake_fire_book"
    ],
    "script": [
      "warp=student_3__respawn_mei_hua_node"
    ]
  },
  "despawn_mei_hua": {
    "trigger": "on_step",
    "conditions": [
      "saw_jin_shi_taken_away",
      "!have_item=key_fake_fire_book",
      "!told_mei_hua_ub_picky"
    ],
    "script": [
      "destroy=npcstudent__student_2",
      "warp=student_3__despawn_mei_hua_node"
    ]
  },
  "recovering_burnt_body": {
    "trigger": "on_step",
    "conditions": [
      "have_quest=kesvelt_fake_books",
      "!saw_jin_shi_taken_away"
    ],
    "flags": [
      "saw_jin_shi_taken_away"
    ],
    "script": [
      "saw_jin_shi_die++text=Mei-Hua__Didi...",
      "!saw_jin_shi_die++text=???__Didi...",
      "invisible_leader=true",
      "walk=leader__S3E8",
      "walk=dead_jin_shi0__S1&&medic_0__S1&&medic_1__S1",
      "saw_jin_shi_die++text=Mei-Hua__Didi... why...",
      "!saw_jin_shi_die++text=???__Didi... why...",
      "walk=dead_jin_shi0__S5--200&&medic_0__S5--200&&medic_1__S5--200",
      "walk=dead_jin_shi0__S15--1&&medic_0__S15--1&&medic_1__S15--1",
      "walk=leader__W8N3",
      "invisible_leader=false"
    ]
  },
  "confronted_by_mei_hua": {
    "trigger": "on_step",
    "conditions": [
      "!confronted_by_mei_hua",
      "have_item=key_burnt_book"
    ],
    "flags": [
      "confronted_by_mei_hua"
    ],
    "script": [
      "???__Hold it.",
      "warp=student_3__mei_hua_hiding_spot",
      "walk=student_3__W2N2",
      "Mei-Hua__You are that faithful from before, are you not? The one who saw Jin-Shi taken here. Tell me, is this really joke to you? Just... fun?",
      "Mei-Hua__...You are actually looking to help? Thank you. I knew I am not the only one who think this was suspicious.",
      "Mei-Hua__My name is Mei-Hua. Jin-Shi was my little brother. We came here from Napo-- ...the northern islands of Lingin. Our mother was an islander so, even though father was not, we had not much money.",
      "Mei-Hua__We hear old king allowed for half-breeds like us to become disciples, so we came to Kesvelt, where no one knew us, to study under Prometus.",
      "Mei-Hua__But the books. They were more expensive than we thought. Even after years of work we couldn't afford second prayer book. I wanted to share, but my brother... heh, he was just so stubborn.",
      "Mei-Hua__He found a man, he said, selling used prayer books at the side of the bookstore. That was the book he was using when he...",
      "Mei-Hua__The bookseller say no #shady# #guy# like this exists, but I know my brother. He was no thief, and no liar.",
      "Mei-Hua__Please, you are faithful. You can make people do things, can you not? Please, find out who killed my brother.",
      "Mei-Hua__I be at the south of castle. Tell me there.",
      "complete_quest_step=kesvelt_fake_books__visit_morgue",
      "walk=student_3__W1N8",
      "walk=student_3__N10--1"
    ]
  },
  "meet_renald_at_bookstore": {
    "trigger": "on_step",
    "conditions": [
      "leader_wear=acc_burqa",
      "bookseller_said_code_phrase",
      "!completed_quest_step=kesvelt_fake_books__obtain_book"
    ],
    "flags": [
      "bought_book_from_renald"
    ],
    "script": [
      "warp=bubba_renald__renald_hiding_spot",
      "walk=bubba_renald__E1N3",
      "Bubba Renald__Oh, pardon me, young one. --n Hm, is something the matter?",
      "Bubba Renald__Ah, I think I understand. Those prayer tomes are quite expensive, aren't they. Well then, come with me.",
      "walk=bubba_renald__S3W2&&leader__E1S3W1",
      "Bubba Renald__Now, normally I'm not supposed to do this, but these are some older editions of the tomes. They're pretty much the same as the ones the other disciples will be using, though.",
      "Bubba Renald__It would be a shame if you came here all the way from the sands of Alteni only to denied Prometus's embrace by price, wouldn't it?",
      "Bubba Renald__So just for you, how does 30 pieces sound?",
      "Bubba Renald__What's with that glare? I'm not trying to dupe you, honest! --n In fact, tell you what. When you go to lessons, if it turns out this tome is full of nonsense, feel free to tell your instructor Bubba Renald gave you a fake book.",
      "Bubba Renald__But otherwise, it's our little secret. Deal?",
      "add_item=key_fake_fire_book",
      "take_gold=30",
      "Inventory__(You got Disciple Text to Spreading Miracles of Prometus!)",
      "Bubba Renald__Goodbye then, disciple.",
      "complete_quest_step=kesvelt_fake_books__obtain_book",
      "give_quest_step=kesvelt_fake_books__tell_mei_hua",
      "walk=bubba_renald__E2N1E3N8&&leader__E2"
    ]
  },
  "clothing_montage": {
    "trigger": "on_step",
    "script": [
      "Bahati__Is that my darling Maddy's voice I hear?",
      "change_object_state=bahati#phitemos__talk",
      "warp=bahati#phitemos__harem_lounge_to_harem_stairs_d",
      "walk=bahati#phitemos__E4N3E2S1",
      "Maddy__Oh! Bahati! GASP, is that--",
      "change_object_state=bahati#phitemos__pose",
      "Bahati__Why indeed it is, my beloved! Ronpa tue Eredemos! I, Bahati Uzuri, have shed the cocoon of the Phitemos and can now soar like a butterfly of the Eredemos!",
      "You__(It doesn't look any different to you...)",
      "change_object_state=bahati#phitemos__talk",
      "Maddy__Bahati, congratul--",
      "change_object_state=bahati#phitemos__drama",
      "Bahati__Not a step closer, you beautiful creature. Though it pains me to say it, you are a child of the Phitemos, while I am a woman of the Eredemos.",
      "Bahati__Our love, it is forbidden!",
      "change_object_state=bahati#phitemos__talk",
      "Maddy__But... you're only five days older than--",
      "change_object_state=bahati#phitemos__drama",
      "Bahati__Forbidden!",
      "change_object_state=maddy#phitemos__blushing",
      "walk=maddy#phitemos__E1",
      "Maddy__I-I-I- OK!?",
      "change_object_state=maddy#phitemos__talk",
      "change_object_state=bahati#phitemos__talk",
      "Bahati__Now that our tragedy has been established, good {time_of_day}, Forel. What brings you to my darling Maddy's room? Were it anyone else, I'd assume I was interupting una cita~.",
      "Maddy__Nonononono, sin cita, lo prometo! --n Actually...",
      "screen_fade_out=",
      "screen_fade_in=",
      "Bahati__Disciples mysteriously burning alive? I daresay, this sounds like something Terio Resuleto would investigate.",
      "Maddy__I thought the same thing!",
      "Bahati__However, I fear you've gotten as far as you can on your own.",
      "visited_bookstore++Bahati__Forel, you said you visited this store yourself, did you not? And yet no shady individuals approached you? I think the reason why is obvious.",
      "visited_bookstore++Bahati__Even if Forel visited the bookstore, he won't be visited by our shady friend.",
      "Maddy__Why is that?",
      "Bahati__Why, just look at our dear Forel!",
      "leader_wear=acc_harem_robe++Bahati__The Ronpa tue Phitemos is made from the silk of an extinct species of cave spiders, sewn by craftsmasters and blessed with prayers by wizards centuries past.",
      "!leader_wear=acc_harem_robe++Bahati__Does he look like he's been in a bad situation in the past decade? Grumpy and brutish, perhaps, but hardly poor.",
      "!leader_wear=armor_none++jump=5",
      "Bahati__And that figure! Mmmm~ --n Uzuri wote huu kwa mtu mmoja, Uzuri anawashwa.~",
      "Maddy__Umm, Bahati, we're not supposed to flirt with him, remember?",
      "Bahati__I was not flirting, my dear, I was merely telling the truth. I can admire a person's physique without pursuing them.",
      "You__(Did she have to say your physique 'set her aflame', though?)",
      "Bahati__Anyways, my point is...",
      "Bahati__Who in their right mind would see Forel as he is now and assume him a pauper?",
      "Maddy__So, we need to make Forel look poor? How do we do that?",
      "change_object_state=bahati#phitemos__evil",
      "Bahati__Leave that to me, my dear.",
      "Bahati__To Beauty Boutique!",
      "Bahati__Oh, and Maddy.",
      "Bahati__See you again in four days. If you'll have me, I shall make your first night in the Eredemos unforgettable.",
      "change_object_state=maddy#phitemos__blushing",
      "walk=bahati#phitemos__N1W2S1X1S3&&leader__X1W3S4",
      "screen_fade_out=",
      "change_object_state=maddy#phitemos__stand",
      "teleport=kesvelt_cutscene_dressstore__new_game_spawner",
      "invisible_leader=true",
      "change_object_sprite=fake_leader__Forel Costumes__0__0",
      "screen_fade_in=",
      "wait=1000",
      "change_object_sprite=fake_leader__Forel Costumes__0__1",
      "wait=1000",
      "change_object_sprite=fake_leader__Forel Costumes__0__2",
      "wait=1000",
      "change_object_sprite=fake_leader__Forel Costumes__0__3",
      "wait=1000",
      "change_object_sprite=fake_leader__Forel Costumes__0__4",
      "wait=1000",
      "change_object_sprite=fake_leader__Forel Costumes__0__5",
      "Bahati__What? Do you realize how often I get the chance to have you try on outfits?",
      "Bahati__Exactly, never! And with you galivanting off in search of glory, Edinkira knows when I'll be able to do this again.",
      "Bahati__...Oh, very well. You're lucky I need to freshen up for Maddy's birthday present tonight. Here.",
      "Bahati__This is the best I could make on, and I make this pun with love, such short notice.",
      "force_equip=leader__acc_burqa",
      "invisible_leader=false",
      "Bahati__An Alteni burqa! It's made in the Amoresian kuvunjwa-zuri, and-- --n Forel! Don't allow me to start prattling on about fashion trends when I need to close up shop. It's quite rude!",
      "Bahati__Now shoo! Go and find your immolater!",
      "screen_fade_out=",
      "give_quest_step=kesvelt_fake_books__obtain_book",
      "give_quest_hint=kesvelt_fake_books__uzuri_advice",
      "teleport=kesvelt_ground__after_montage_node",
      "screen_fade_in="
    ],
    "conditions": []
  },
  "confronting_renald": {
    "trigger": "on_step",
    "script": [
      "screen_fade_out=",
      "teleport=kesvelt_cutscene_temple__new_game_spawner",
      "force_equip=leader__acc_harem_robe",
      "screen_fade_in=",
      "Bubba Renald__Mei-Hua. Are you well? I do hope you've recovered from that horrid display earlier with Jin-Shi--",
      "Mei-Hua__Don't you speak his name, rat.",
      "Bubba Renald__...Very well, I can see you haven't. I understand watching a person die was quite troubling.",
      "walk=student_3__N1--100",
      "Mei-Hua__Shut up, murderer!",
      "Papa Esconce__Young lady, these hallowed grounds are not the place for such vulgar--",
      "Bubba Renald__It's not her fault, Papa. This is one of my disciples who saw the incident I spoke of. It affected her more than most. Please, allow me to handle this.",
      "Papa Esconce__Very well. I'll leave her discipline to you, Renald. But do not baby her. Such language outside Prometus's temple cannot be simply forgiven.",
      "Bubba Renald__Understood, Papa.--dai",
      "walk=head_wizard__N5--150",
      "Bubba Renald__Now, listen, Mei-Hua. If you're upset I was unable to save... that student before, I am as well. But I had to ensure the safety of you and your fellow disciples first. The miracle he performed had flames that could easily spread to anyone he touched, so--",
      "Mei-Hua__We know about your fake books.",
      "Bubba Renald__I beg your pardon?",
      "Mei-Hua__Those fake books you give to poorer disciples. We know them. You sell fake books to them, books that had prayer for cold swapped for wearing fire!",
      "Bubba Renald__I-- K-k-kind faithful. Please tell me you haven't been filling this distressed young woman's head with fantasies for your own amusement.",
      "change_object_state equals student_3__show_book",
      "Mei-Hua__He has not. He is one who helped me get this, and told me where!",
      "Bubba Renald__What? But, how-- --n ...You.",
      "Mei-Hua__Are we wrong? Temple is there. Just step in and say you didn't sell him book. You have faith Prometus would not burn you for telling the truth, no?",
      "Bubba Renald__...",
      "Mei-Hua__Why, Bubba?",
      "Bubba Renald__... ...Well, you are wrong about one thing. I haven't been targeting the 'poorer students'. Not that I blame you for thinking so.",
      "change_object_state=cutscene_imedes_renald__head_tilt--500",
      "Bubba Renald__The half-breed vermin that crawl here from other kingdoms aren't exactly wealthy, in coin or in spirit, are they?",
      "Mei-Hua__What?",
      "Bubba Renald__*Insert racist rant here, followed by appeal to Mei-Hua to join Bubba Renald.",
      "Mei-Hua__You think after you killed my brother I'd do ANYTHING with you!?",
      "Bubba Renald__...Come again? Your what?",
      "Mei-Hua__Jin-Shi was my didi, my little brother! Did you not even know that?",
      "Bubba Renald__But... but your eyes, your noses... Your names!",
      "Mei-Hua__Our father named me because I looked more like him! Jin-Shi was named by our mother! Is that really it? If it had been the other way around, you would've killed me instead?",
      "Bubba Renald__Instead? No, no. Once I'd found out he'd been deceiving me...",
      "walk=cutscene_imedes_renald__S1--300&&student_3__S1--100",
      "Bubba Renald__He'd die too.",
      "walk=leader__N1W1",
      "Bubba Renald__A firebrand, eh? So you're that faithful. The urchin bastard, the mongrel who howls for his master every night like a good little lapdog.",
      "Bubba Renald__Is it true your father was a whore? Like father, like son, I suppose.",
      "Bubba Renald__And is it true your mother died in the Blue Moon Tragedy, as well? I can't blame her for wanting some time away from you.",
      "walk=cutscene_imedes_renald__S1--50",
      "Bubba Renald__...No reaction? You're no fun. Ah well.",
      "walk=cutscene_imedes_renald__N2",
      "Bubba Renald__With the king's favorite pet speaking against me, I have no chance of defending myself, do I? Since I'm one foot in the grave, let's see if I can bury you with me.",
      "Notes__(Pretend there is a fight here)",
      "teleport equals Kesvelt_Temple__new_game_spawner",
      "Bubba Renald__No... No, this is impossible. A bastard and a half-breed foreigner, defeating me? This can't be. I am a wizard of Prometus. You are a pair of shades that convinced everyone else you're human!",
      "Bubba Renald__Your very existence is a blasphemy on these holy lands! Bastards, foreigners, none of you should have access to miracles!",
      "Archmage Imedes__Not even me?",
      "change_object_state=cutscene_imedes_renald__imedes_ambush--1000",
      "Archmage Imedes__I'm no bastard, but I sincerely doubt you could call me a 'native'.",
      "Bubba Renald__A-a-archmage...",
      "Archmage Imedes__I knew something was off, but I would never have guessed a man of the clergy to be responsible.",
      "Archmage Imedes__Those disciples trusted you, Renald. Trusted you to teach them how to extend Prometus's gifts to the world. And what did you do? You set that trust ablaze on your prejudice and your greed!",
      "Archmage Imedes__How did you get so far in your training yet understand so little?",
      "Bubba Renald__I'm-- I'm so-- I'm sorry--",
      "Archmage Imedes__Perhaps you need to review the basics. First rule of being an instructor:",
      "Archmage Imedes__Never ask of your students what you are unwilling to do yourself.",
      "Bubba Renald__No, no please--",
      "change_object_state=cutscene_imedes_renald__burning",
      "Bubba Renald__Ahhhhh! Ahhhhhh!",
      "Bubba Renald__Someone! Anyone! Help me! I--",
      "change_object_state=cutscene_imedes_renald__walk--3000",
      "walk=student_3__N1--1000&&leader__W1--1000",
      "Mei-Hua__Archmage?",
      "Archmage Imedes__I'll be alright, child. Just... just give me a moment.",
      "change_object_state=cutscene_imedes_renald__sleep",
      "Archmage Imedes__Very well, then. I suppose you want to yell at me now? Perhaps for stealing your chance to avenge your brother?",
      "Mei-Hua__Actually... I wanted to thank you. When I had heard so many had died like Jin-Shi had, I thought that no one cared. Besides, I had the chance to kill him, before you showed up. But when it came down to it...",
      "Mei-Hua__I'm such a coward.",
      "Archmage Imedes__Child, do not berate yourself for being unable to take a life, even one as worthless as this creature. The world would be a much better place if a few more lacked that particular talent.",
      "Archmage Imedes__But, if you must make up for it in some way, inform Papa Esconce of what transpired here. And that the Archmage commands him to confiscate all prayer texts within the temple.",
      "Archmage Imedes__Just because we had these casualties now, doesn't mean they're all that could occur. If Renald had any sense, he'd stagger out the 'accidents' by varying up where he put his changes.",
      "Archmage Imedes__Once you've done that, take some time to reflect on what this means. Even if unknowingly, the temple betrayed you and yours. Be certain any decision to stay or leave is made with a clear mind.",
      "Mei-Hua__U-understood, Archmage.",
      "walk=student_3__N3",
      "walk=student_3__E1N1--500",
      "walk=student_3__N5--100",
      "Archmage Imedes__As for you, boy.",
      "Archmage Imedes__...It has recently come to my attention that the education of some was potentially... subverted. And I am in no shape right now to continue my research.",
      "Archmage Imedes__So, if you wished to visit my lab... well, I can think of worse ways to spend time recovering than reviewing the basics. To be safe.",
      "screen_fade_out=",
      "teleport=kesvelt_ground__after_montage_node",
      "complete_quest_step=kesvelt_fake_books__confront_renald",
      "give_quest_step=kesvelt_fake_books__visit_imedes",
      "screen_fade_in="
    ],
    "conditions": []
  }
}