{
    "melee_training": {
        "destroy_trigger_object" : "after_trigger",
        "trigger" : "after_step",
        "script" : [
            "walk=guard_sergeant__alternateES3",
            "text=Sergeant Caballera__Well, well. If it isn't His Majesty's lapdog. Last I heard, you were off chasing some fancy disciple gig after deciding my recruits weren't fit to guard your king.",
            "text=Sergeant Caballera__If it were anyone but these sorry louts, I might be insulted. So, what brings you crawling back?",
            "text=Sergeant Caballera__The king wants proof you can actually hold a weapon, huh? So my wife wasn't just flapping her gums after all.",
            "text=Sergeant Caballera__Rencid! Eieun!",
            "walk=training_guard_3__N3&&training_guard_2__N2W1",
            "text=Rencid__Y-yes, Sarge?",
            "text=Sergeant Caballera__It's your lucky day, ladies. You get to knock some sense into this pampered little street rat.",
            "text=Rencid__Y-you heard that, Sergeant?",
            "text=Sergeant Caballera__The barracks walls aren't as thick as your skulls, and my ears still work just fine.",
            "text=Eieun__B-but... are we even allowed to fight him? He's, uh...",
            "leader_wear=armor_pjs++text=Eieun__He's not even dressed, for one.",
            "text=Sergeant Caballera__It's just a warm-up. What, you think I'd let a scuffle with you two decide if he's combat-ready?",
            "text=Sergeant Caballera__...Or maybe I should. What do you say, lapdog? Think you can handle two-on-one before you've even put your pants on? (Y/N) (This kind of question will show up from time to time. Simply type 'Y' for yes or 'N' for no to continue. Be sure to answer honestly, though. It wouldn't do to be caught in a lie or over your head, now would it?)&&await_yn8",
            "text=Sergeant Caballera__Alright then. Should be easy enough. These two are only the least incompetent of this year's sorry batch.",
            "text=Sergeant Caballera__Oh, and one rule-- no healing or offensive miracles. Don't heal yourself, don't scorch them, zap them, whatever those baldies have been teaching you. I mean, I won't stop you, but it kind of defeats the point of proving you can actually fight, doesn't it?",
            "text=Sergeant Caballera__Speaking of, here--",
            "add_item=weapon_staff",
            "force_equip=leader__weapon_staff",
            "text=Inventory Message__Obtained and equipped the Practice Staff!",
            "text=Sergeant Caballera__You heard him, ladies. He wants a real fight. So don't worry, you won't hang if he stubs his toe.",
            "force_combat=Training_Fight_Melee_Hard",
            "text=Sergeant Caballera__See? Just a warm-up. Aren't you two lucky.",
            "add_item=weapon_staff",
            "text=Inventory Message__Obtained the Practice Staff!",
            "text=Sergeant Caballera__Equip that the same way you put on your robe, lapdog. All that time in the Phitemos hasn't made you forget how to dress yourself, has it?",
            "text=Sergeant Cabellera__Once you've got a good grip, talk to one of these two buffoons.",
            "walk=guard_sergeant__alternateNW3"
        ]
    }
}