{
  "melee_training": {
    "trigger": "after_step",
    "conditions": [
      "!have_item=weapon_staff"
    ],
    "script": [
      "walk=guard_sergeant__alternateES3",
      "Sergeant Caballera__Well, well. If it isn't His Majesty's lapdog. Last I heard, you were off chasing some fancy disciple gig after deciding my recruits weren't fit to guard your king.",
      "Sergeant Caballera__If it were anyone but these sorry louts, I might be insulted. So, what brings you crawling back?",
      "mid_quest_step=assure_eraton__train_weapons++jump=5",
      "Sergeant Caballera__Nothing? Just wanting to watch, then? Yeah, the faithful always do. Can't blame 'em. Must be fun seeing these buffoons play with spears when you're not in charge of 'em.",
      "Sergeant Caballera__Unfortunately for you, Lapdog, you're not a recruit anymore, or a soldier. That means you've got to watch from behind the gate like everyone else.",
      "walk=leader__E1&&guard_sergeant__alternateNW3",
      "force_end=",
      "jump=999",
      "Sergeant Caballera__The king wants proof you can actually hold a weapon, huh? Well in that case...",
      "Sergeant Caballera__Rencid! Eieun!",
      "walk=training_guard_3__N3&&training_guard_2__N2W1",
      "Rencid__Yes, Sarge?",
      "Sergeant Caballera__It's your lucky day, ladies. You get to knock some sense into this pampered little street rat.",
      "Eieun__Y-you heard that, Sergeant?",
      "Sergeant Caballera__The barracks walls aren't as thick as your skulls, and my ears still work just fine.",
      "Eieun__B-but... are we even allowed to fight him? He's, uh...",
      "leader_wear=armor_pjs|armor_none++Eieun__He's not even dressed, for one.",
      "Sergeant Caballera__It's just a warm-up. Besides, I put him through much worse a few years back. The king won't give you the axe if he stubs his toe.",
      "add_item=weapon_staff",
      "Inventory Message__(Obtained the Practice Staff!)",
      "Sergeant Caballera__Equip that the same way you put on your robe, lapdog. All that time in the Phitemos hasn't made you forget how to dress yourself, has it?",
      "Sergeant Cabellera__Once you've got a good grip, talk to one of these two buffoons.",
      "walk=guard_sergeant__alternateNW3"
    ]
  },
  "melee_training_fight": {
    "trigger": "on_step",
    "flags": [
      "fought_rencid"
    ],
    "script": [
      "spawn=node__leader--training_return_",
      "force_combat=Training_Fight_Melee",
      "Sergeant Caballera__Remember, there's only one rule in a real fight: kill or be killed!",
      "Sergeant Caballera__But since this isn't a real fight, these ladies'll focus on beating the snot outta you.",
      "Sergeant Caballera__But before they can do that, remember, you'll need to get into beating range!",
      "Sergeant Caballera__In case you're an idiot, that means moving left!",
      "reforce_combat=",
      "allow_input=K_LEFT",
      "Sergeant Caballera__Eieun, hold! Rencid, Lapdog, advance!",
      "Rencid and Eieun__Sir, yes sir!",
      "change_object_arg=event_at_combat_start__round_timer__3",
      "reforce_combat=",
      "allow_input=K_LEFT",
      "Sergeant Caballera__Now that you're face-to-face with your enemy, it's time to fight!",
      "__(Press 'A' to enter attack mode, then press a direction key. You can only attack in the four cardinal directions, so Rencid is your only valid target.)",
      "change_object_arg=event_at_combat_start__round_timer__5",
      "change_object_arg=training_guard_1__pause_round__4",
      "reforce_combat=",
      "require_input=K_a",
      "require_input=K_UP",
      "require_input=K_a",
      "require_input=K_UP",
      "Sergeant Caballera__Well, would you look at that, Lapdog. You're surrounded! And at this rate, you'll be dead!",
      "Sergeant Caballera__Lucky for you, there's a way to get these ladies off your back!",
      "__(Press 'S' to perform a special attack depending on the weapon you have equipped.)",
      "__(Since you're holding a staff, you'll perform a sweep on all adjacent units. It won't do any damage, but it will send them flying back two tiles, giving you some breathing room.)",
      "__(Try it out!)",
      "change_object_arg=event_at_combat_start__round_timer__6",
      "reforce_combat=",
      "allow_input=K_s",
      "Sergeant Caballera__Attaboy, Lapdog! Don't let up now! Keep on Rencid!",
      "Rencid__Wha-- why me, Sarge!?",
      "Sergeant Caballera__Well, now it's because you're giving me lip, recruit!",
      "change_object_arg=event_at_combat_start__round_timer__14",
      "reforce_combat=",
      "Sergeant Caballera__Alright, that's enough.",
      "__(Sergeant Caballera calls over a medic to see to any bruises.)",
      "screen_fade_out=",
      "restore_hp=all",
      "teleport=Kesvelt_Ground__training_return_0",
      "screen_fade_in=",
      "Sergeant Caballera__I'll tell the king you probably won't die on your little trip.",
      "Sergeant Caballera__Hm? What's with that look? Is my recommendation not good enough for you? Are you really going to insist you want a harder test?",
      "Sergeant Caballera__...Fine. Listen here. There's a mob of crooks hanging out in that 'L'-shaped cul-de--",
      "walk=leader__S1",
      "Sergeant Caballera__What? You were talking big just a second ago, now you wanna run with your tail between your legs?",
      "wait=500",
      "walk=leader__N1",
      "Sergeant Caballera__That's what I thought.",
      "Sergeant Caballera__The 'L'-shaped cul-de-sac, fourth house, the only one made of wood. There's been a band of thugs squatting there for a decade or so, but lately they've been causing trouble the captain isn't too keen on ignoring anymore.",
      "Sergeant Caballera__Since you're so insistent, I'll hold off on praising you to the Sydan 'till you get back from dealing with them, kind faithful.",
      "Sergeant Caballera__Dismissed!",
      "give_quest=kesvelt_gang",
      "give_quest_step=kesvelt_gang__fight_baddies",
      "give_quest_hint=kesvelt_gang__home",
      "change_event_key=event_melee_training__overhear_rencid"
    ],
    "conditions": []
  },
  "overhear_rencid": {
    "trigger": "on_step",
    "flags": [
      "overheard_rencid"
    ],
    "conditions": [
      "!overheard_rencid"
    ],
    "script": [
      "walk=training_guard_3__N1W1",
      "Rencid__Sergeant, with respect, why on earth are you sending that boy to deal with thugs? A sparring match is one thing, but these are hardened criminals we're talking about.",
      "walk=training_guard_2__N2",
      "Eieun__Rencid, stop! If you keep talking back to the sergeant like that, you'll get in even more trouble!",
      "Sergeant Caballera__At ease, recruit. While Rencid needs to learn to watch her mouth, I'm not in the habit of punishing concern over an ally's well-being. She's right to worry about him.",
      "__(Does he realize you can hear them?)",
      "Sergeant Caballera__I spent six months trying to whip that boy into shape. He already had a soldier's mindset, but that doesn't mean much if your body can't keep up, and his couldn't.",
      "Sergeant Caballera__But here's the thing. While that boy is stubborn, he's smart. Lost almost every spar, but he'd make damn sure you earned a win. Eventually, he even learned to throw in the towel.",
      "Sergeant Caballera__Once he realizes just how different a real fight is, he'll get out of there and run back to the Phitemos, just you watch.",
      "__(...)",
      "Sergeant Caballera__Besides, Krebons hasn't actually designed that combat encounter, so it's not like Forel can actually go and do it.",
      "__(!?)",
      "Sergeant Caballera__His quest log will show the quest as completed now.",
      "finish_quest_step=kesvelt_gang__fight_baddies",
      "finish_quest_step=kesvelt_gang__tell_sarge",
      "finish_quest=kesvelt_gang",
      "Rencid__Oh... well, alright then."
    ]
  },
  "magic_lesson": {
    "script": [
      "Archmage Imedes__Let's get started. I'd rather not the mponyaji return to find me lecturing after she ordered me to get bed rest.",
      "Archmage Imedes__Always so full of themselves, those healer types. They see a single scrape on you and suddenly you're an infant to them.",
      "Archmage Imedes__But that's besides the point.",
      "start_cutscene=imedes_lesson",
      "screen_fade_out=",
      "spawn=node__leader--training_return_",
      "force_combat=Training_Fight_Magic",
      "screen_fade_in=",
      "Archmage Imedes__First, let's see you perform that miracle yourself. See that skeleton over there?",
      "__(You pray for miracles by typing the prayer into the input line. Once you pass this paragraph, press 'C' to open the input line, then type 'kua stein'.)",
      "reforce_combat=",
      "require_spell=kua stein",
      "Archmage Imedes__Not terrible... but hardly dangerous. Remember what you said, boy. You fight to protect what your Sydan cherishes.",
      "Archmage Imedes__That isn't just a skeleton, that is an enemy. If you hold back, it will destroy you. It seeks to hurt your Sydan through you. Are you going to let it?",
      "Archmage Imedes__Now, try again.",
      "change_object_arg=event_at_combat_start__round_timer__2",
      "reforce_combat=",
      "require_spell=kua stein",
      "Archmage Imedes__Ha-ha, much better! And I suppose now is an ideal time to ask: how are your legs? Do they feel particularly heavy? Sleepy?",
      "Archmage Imedes__No? Well then you should be able to walk around just fine, shouldn't you?",
      "__(On the off-chance you have trouble walking around, remember you can always pass your turn by pressing spacebar.)",
      "change_object_arg=event_at_combat_start__round_timer__3",
      "reforce_combat=",
      "Archmage Imedes__A bit jarring, isn't it? Miracles are powerful things, but much like a powerful blade or a grand suit of armor they do not come cheap.",
      "Archmage Imedes__However, the gods do not ask coin of you. Instead, they desire dedication of your own body. When miracles are used in moderation, these effects are negligible.",
      "Archmage Imedes__After a certain point, however, they will affect your body and your health. When too many Nertian miracles, or a single powerful one, are prayed for in succession, you will be unable to move for a time.",
      "Archmage Imedes__In order to recover, simply refrain from praying for a time. Go ahead and try moving your legs now, then return to my side.",
      "reforce_combat=",
      "Archmage Imedes__Much better, yes?",
      "Archmage Imedes__Now then, let's see you work with Prometian miracles. To throw a small orb of fire, simply pray 'kua fire'. Again, throw it towards the skeleton.",
      "Archmage Imedes__No, no, quit your bellyaching. The skeleton may not be made of popelm wood, but it's not likely to burn.",
      "change_object_arg=event_at_combat_start__round_timer__now+1",
      "reforce_combat=",
      "require_spell=kua fire",
      "Archmage Imedes__...",
      "Archmage Imedes__...Right then. This is a valuable lesson that 'not likely' does not mean 'impossible'. --n Young Forel, if you would please put out that fire?",
      "Archmage Imedes__A prayer to Salacius, 'kua agua', should be sufficient.",
      "change_object_arg=event_at_combat_start__round_timer__+1",
      "reforce_combat=",
      "require_spell=kua agua",
      "Archmage Imedes__COUGH COUGH, and now COUGH, 'kua ventus' to get rid of the smoke.",
      "change_object_arg=event_at_combat_start__round_timer__+1",
      "reforce_combat=",
      "require_spell=kua ventus",
      "Archmage Imedes__SIGH, much better. It'd be rather pathetic to survive to 187, and being burned alive, only to be done in by some smoke.",
      "Archmage Imedes__But silver linings, and all that. Pay attention to your body. Do you feel a chill? Parched? Short of breath?",
      "Archmage Imedes__It is as I said. Any prayers, even to other gods, will not allow your body to recover. Only moving, attacking, or waiting will do that.",
      "screen_fade_out=",
      "teleport=Kesvelt_Laboratory__training_return_0",
      "screen_fade_in=",
      "Archmage Imedes__Do not fret on the limitations of your body, young Forel. As your faith grows, so too will your body's resilience to these effects.",
      "Archmage Imedes__However, on the subject of faith, I must warn you of something crucial. Your plan? Your desire to become favored by all of the eight?",
      "Archmage Imedes__Abandon it.",
      "Archmage Imedes__I do not speak in mockery like others might when I say this. Earning the favor of all Eight is simply impossible. To earn Their favor you must not only prove yourself in battle, but live in ways that please Them.",
      "Archmage Imedes__And the Eight are fickle beings. What pleases Them can be confusing, even contradictory. It simply cannot be done.",
      "Archmage Imedes__Three is what I would recommend. --n Well, in truth, I would recommend earning the favor of one deity, but seeing that glare I can tell you won't be satisfied with the bare minimum.",
      "Archmage Imedes__You seek to prove your worth to the Sydan's court and the kingdom, do you not? Most of the great wizards of history were favored by only three. Anyone to scoff at that might as well be committing a heresy.",
      "Archmage Imedes__...Yes, I suppose there are some that became favored by four, but believe me when I say that is not likely.",
      "Archmage Imedes__Now shoo, boy. I need to pretend I've been resting before the mponyaji gets back.",
      "complete_quest_step=kesvelt_fake_books__visit_imedes",
      "complete_quest=kesvelt_fake_books",
      "Archmage Imedes__...But before you leave, study the tomes in my research hall. Once you have read all eight, and I'll be able to tell if you have, I shall give the Sydan my assurances.",
      "__(You don't actually have to. Krebons hasn't written anything in them yet.)"
    ],
    "conditions": [],
    "trigger": "on_step"
  },
  "bed_ridden_imedes": {
    "script": [
      "change_object_state=imedes_bed0__stand",
      "change_object_state=imedes_bed1__stand",
      "warp=imedes_torso__bed_ridden_imedes",
      "warp=imedes_head__bed_ridden_imedes"
    ],
    "conditions": [
      "mid_quest_step=kesvelt_fake_books__visit_imedes"
    ],
    "trigger": "on_step"
  }
}